[
  {
    "path": "posts/2022-02-22-relationships-between-selected-black-throated-blue-warbler-characteristics-and-mass/",
    "title": "Relationships Between Selected Black-throated Blue Warbler Characteristics and Mass",
    "description": "In this analysis, I investigated the relationships between various characteristics of black-throated blue warblers and their mass using multiple linear regression. The analysis began with exploratory visualizations, including scatterplots and beeswarm plots, to identify potential linear relationships and outliers. Then, I performed multiple linear regression to quantitatively describe the relationships between mass and other recorded features such as wing length, sex, bill dimensions, and tarsus length. Model selection was based on diagnostic plots, Adjusted R-squared, and AIC scores to ensure the best balance between model fit and complexity.",
    "author": [
      {
        "name": "Mariano Viz",
        "url": {}
      }
    ],
    "date": "2022-02-22",
    "categories": [],
    "contents": "\nSummary\nIn this report, I explore the relationships between selected\nblack-throated blue warbler characteristics and mass. First, I visually\nexplore the data. Then, I use multiple linear regression to describe the\nrelationship.\n\n\n\n1. Exploratory Visualization\nExploratory scatterplots exploring linear relationship (also\nuseful for identifying notable outliers and having some initial thoughts\nabout homoscedasticity)\nBeeswarm plot for visualizing the relationship between bird mass\nand elevation of the sample plot (low, mid, or high)\n\n\n\n2. Multiple linear regression\nExploring\nrelationships between bird mass (dependent variable) and other recorded\nfeatures (explanatory variables)\n\n\n\nComparing the different\nmodels:\nObservation of how the coefficients change in the different\nmodels as predictor variables change\nAssessment of model fit (Adjusted R-squared)\nDiagnostic plots for exploring model assumptions\n(homoscedasticity and distribution of residuals and Cook’s\ndistance)\nComparison of the quality (balance: model fit / complexity) of\nthe different models (AIC)\nSelected model outcomes\n\n\n\n\n\n\nDependent variable:\n\n\n\n\n\n\n\n\nmass\n\n\n\n\nwing_r\n\n\n0.071***\n\n\n\n(0.015)\n\n\n\n\n\n\nsexM\n\n\n-1.038***\n\n\n\n(0.068)\n\n\n\n\n\n\nbill_depth\n\n\n0.112\n\n\n\n\n(0.148)\n\n\n\n\n\n\nbill_culmen\n\n\n0.138***\n\n\n\n(0.047)\n\n\n\n\n\n\ntarsus1\n\n\n0.061*\n\n\n\n(0.034)\n\n\n\n\n\n\nConstant\n\n\n3.384***\n\n\n\n(1.173)\n\n\n\n\n\n\n\n\nObservations\n\n\n667\n\n\nR2\n\n0.331\n\n\nAdjusted R2\n\n0.325\n\n\nResidual Std. Error\n\n\n0.588 (df = 661)\n\n\nF Statistic\n\n\n65.262*** (df = 5; 661)\n\n\n\n\nNote:\n\n\np<0.1; p<0.05;\np<0.01\n\n\nJustification of the model\nselection\nDiagnostic plots for exploring model assumptions reveal normally\ndistributed and homoscedastic residuals for all models. In the evaluated\nmodels, Adjusted R-squared (a measure of how much the variance in the\ndependent variable is explained by the explanatory variables in the\nmodel) increases with the addition of more predictor variables. AIC\nshows comparative scores reflecting the balance between the predictive\ncapabilities of the model (model fit) and the increase in complexity due\nto the addition of variables. When comparing the initial models, the\nmodel with the highest number of variables (lm5) showed the best balance\nin model fit/complexity (i.e., the benefits in model fit of adding the\nadditional variables outweigh the increased complexity). However, as the\naddition of the age_banded variable determined an increase in the AIC, I\ndecided to try a new model (lm6) by removing this variable from the lm5\nmodel. Showing a better balance between model fit and complexity (lower\nAIC), lm6 was the selected model.\nInterpretation of lm6\ncoefficients\nWing length coefficient (wing_r 0.071): on average, a 1 mm\nincrease in wing length is associated with a 0.071 g increase in bird\nmass.\nSex coefficient (sexM -1.038): on average, if everything else is\nfixed, we expect males to have a 1.038 g less mass than females\n(reference level).\nBill cross-section depth coefficient (bill_depth 0.112): on\naverage, a 1 mm increase in bill cross-section depth is associated with\na 0.112 g increase in bird mass.\nBill culmen length coefficient (bill_culmen 0.138): on average, a\n1 mm increase in bill culmen length is associated with a 0.138 g\nincrease in bird mass.\nTarsus length coefficient (tarsus1 0.061): on average, a 1 mm\nincrease in tarsus length is associated with a 0.061 g increase in bird\nmass.\nCitation\nRodenhouse, N., R. Holmes, S. Sillett, and M. Webster. 2019.\nBlack-throated Blue Warbler capture histories, Hubbard Brook\nExperimental Forest, 1986 - 2010 ver 4. Environmental Data Initiative.\nhttps://doi.org/10.6073/pasta/ea985022acfdb76cd7beeaf8da6c39b1\n\n\n\n",
    "preview": "posts/2022-02-22-relationships-between-selected-black-throated-blue-warbler-characteristics-and-mass/relationships-between-selected-black-throated-blue-warbler-characteristics-and-mass_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2024-07-31T12:46:41-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-02-15-exploration-of-data-for-marine-turtles-of-species-green-and-loggerhead-captured-in-shark-bay-australia/",
    "title": "Exploration of Data for Marine Turtles of Species Green and Loggerhead Captured in Shark Bay, Australia",
    "description": "In this analysis, I explored the relationship between carapace length and width in green and loggerhead turtles through data visualization and linear regression, which quantitatively described this relationship. A strong positive correlation was found, with 93% of the variance in carapace width being explained by length. Additionally, I compared the carapace lengths between green and loggerhead turtles using a two-sample t-test, which showed no significant difference in mean lengths between the species. Finally, I assessed the association between species and the occurrence of burrowing barnacles using a chi-square test, revealing a significant association between the two variables.",
    "author": [
      {
        "name": "Mariano Viz",
        "url": {}
      }
    ],
    "date": "2022-02-15",
    "categories": [],
    "contents": "\nSummary\nIn this report, I explore the relationship between sea turtle\ncarapace length and width by visualizing the data and performing linear\nregression to quantitative describe this relationship. Then, I\nstatistically compare the carapace lengths between green and loggerhead\nturtles. For this comparison I perform a two-sample t-tests\n(significance level (\\(\\alpha\\)) of\n0.05). Lastly, I explore the association between species (green and\nloggerhead) and the occurrence of burrowing barnacles through a\nchi-square test.\n\n\n\n1.\nRelationship between sea turtle carapace length and width\nExploratory visualization\n\n\n\nLinear\nregression: quantitative description of the relationship between sea\nturtle carapace length and width\n\n\nCall:\nlm(formula = width ~ length, data = sea_turtles)\n\nResiduals:\n     Min       1Q   Median       3Q      Max \n-16.4171  -2.1140  -0.0254   2.2046   9.9637 \n\nCoefficients:\n            Estimate Std. Error t value Pr(>|t|)    \n(Intercept)  5.95970    1.29609   4.598 6.46e-06 ***\nlength       0.86214    0.01396  61.775  < 2e-16 ***\n---\nSignif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1\n\nResidual standard error: 3.396 on 280 degrees of freedom\n  (1 observation deleted due to missingness)\nMultiple R-squared:  0.9316,    Adjusted R-squared:  0.9314 \nF-statistic:  3816 on 1 and 280 DF,  p-value: < 2.2e-16\n\n\nThere is a linear relationship between sea turtles’ carapace length\n(cm) and width (cm). Linear model summary: \\(\\beta\\)1 = 0.86 cm\ncm-1, p < 0.001, R2 = 0.93, Pearson’s\nr = 0.97).\nThis summary shows that, on average, we expect carapace width to\nincrease by 0.86 centimeter for each one centimeter increase in length.\nAt the same time, the R2 shows that 93.16% of the variance in\ncarapace width is predictable from the length. Carapace length and width\nare strongly, and significantly, positively correlated (Pearson’s\nr = 0.97, p < 0.001). Diagnostic plots (not included) show\nnormally distributed and homoscedastic residuals.\n2.\nComparison of carapace lengths between green and loggerhead turtles\nExploratory\nvisualization of distribution\n\n\n\nBell-shaped histogram reflecting a normal distribution (slightly\npositive skew for both green and loggerhead turtles). This normal\ndistribution is also shown by the quantile-quantile plot with a nearly\nlinear relationship.\nTest\nselection: statistically compare carapace lengths for green and\nloggerhead turtles\nFor comparing the carapace lengths for green and loggerhead turtles I\nwill perform a 2-sample t-test. With this test we can compare the means\nof the two groups and know the probability of having obtained sample\nmeans at least this different if they were drawn from populations with\nthe same mean (p-value). The selection of this test is based on the fact\nthat thanks to the histograms and quantile-quantile plots we can see\nthat we satisfy the assumptions about distribution, where carapace\nlengths for green and loggerhead turtles follow a relatively normal\ndistribution (bell-shaped histogram and quantile-quantile plot with an\nalmost linear relationship). In case of not satisfying this assumption,\nwe could use a rank-based alternative (Mann-Whitney U test).\n2-Sample T-Test\n\n\n\nOn average, carapace length of green turtles is slightly greater than\nthat of loggerhead turtles (92.64 \\(\\pm\\) 15.78 and 89.91 \\(\\pm\\) 11.44 cm, respectively; mean \\(\\pm\\) 1 standard deviation). The absolute\ndifference in means is 2.73cm (a 2.98% difference). The effect size is\nnegligible (Cohen’s d = 0.19) and the difference in means\n(significance level (\\(\\alpha\\)) of\n0.05) is not significant (Welch two-sample t-test: t(244.17) = 1.65, p =\n9.98e-02).\n3.\nComparison of the the occurrence of burrowing barnacles on green versus\nloggerhead turtles.\nContingency\ntable containing the counts and proportions of each species with and\nwithout burrowing barnacles observed\nTable 1. Counts and proportions of green and\nloggerhead turtles with (Yes) and without (No) burrowing barnacles.\nData: Heithaus & Thomson (2019).\n\n\nSpecies\n\n\nNo\n\n\nYes\n\n\ngreen\n\n\n87% (164)\n\n\n13% (24)\n\n\nloggerhead\n\n\n69% (66)\n\n\n31% (29)\n\n\nChi-square\ntest for assessing associationn between species (green and loggerhead)\nand the occurrence of burrowing barnacles\n\n\n\nFor green turtles, burrowing barnacles were present in 24 individuals\nand absent in 164. For loggerhead turtles, the presence/absence of\nburrowing barnacles was 29 and 66 respectively. There is a significant\nassociation between species (green or loggerhead) and presence/absence\nof burrowing barnacles. In other words, species and occurrence of\nburrowing barnacles are non-independent (\\(\\chi\\)2(1) = 11.94, p =\n5.5e-04).\nCitation\nHeithaus, M. and J. Thomson. 2019. Marine turtles captured during\nhaphazard at-sea surveys in Shark Bay, Australia from February 2008 to\nDecember 2013 ver 4. Environmental Data Initiative. https://doi.org/10.6073/pasta/7696e20214fbf84f25d664ff7dc8050c\n\n\n\n",
    "preview": "posts/2022-02-15-exploration-of-data-for-marine-turtles-of-species-green-and-loggerhead-captured-in-shark-bay-australia/exploration-of-data-for-marine-turtles-of-species-green-and-loggerhead-captured-in-shark-bay-australia_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2024-07-31T12:41:05-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-02-07-trends-in-steller-sea-lion-pup-populations-for-five-alaskan-rookeries/",
    "title": "Trends in Steller Sea Lion Pup Populations for Five Alaskan Rookeries",
    "description": "In this analysis, I explored trends in Steller sea lion pup populations across five Alaskan rookeries (Sugarloaf, Marmot, Forrester Complex, Chowiet, and Hazy). The analysis involved data wrangling to calculate the mean pup counts by site and year, followed by data visualization to examine the population trends over time. The visual exploration revealed a decline in pup populations at Sugarloaf, Marmot, and Chowiet since 1980, while Hazy showed an increase. The Forrester Complex also showed an overall increase, but a notable drop in 2002 requires further investigation.",
    "author": [
      {
        "name": "Mariano Viz",
        "url": {}
      }
    ],
    "date": "2022-02-07",
    "categories": [],
    "contents": "\nSummary\nIn this report I explore the trends in Steller sea lion pup\npopulations for five Alaskan rookeries (Sugarloaf, Marmot, Forrester\nComplex, Chowiet, and Hazy). First, I wrangle the data to get the mean\nvalue of pup counts by site and year. Second, I visually explore the\ntrends for each site.\n\n\n\nData wrangling:\nFind the mean value of pup counts by site and year\nOnly keep observations from sites Sugarloaf, Marmot, Forrester\nComplex, Chowiet, and Hazy\nOnly columns containing the site name, year, and pup\ncount\nRename pup counts as steller_pups\n\n\n\n\n\n\nData Visualization\n\n\n\nFigure 1. Steller sea lion pup populations per year\nfor five Alaskan rookeries (Sugarloaf, Marmot, Forrester Complex,\nChowiet, and Hazy). Blue points indicate recorded counts of Steller sea\nlion pups. In the case that several counts were recorded for the same\nyear, the plotted value represents the mean of those recorded counts.\nData: Fritz et al. (2015).\nTrends\nin Steller sea lion pup populations for the five Alaskan rookeries\nCharts show a decline in Steller sea lion pup populations from 1980\nonwards for the sites Sugarloaf, Marmot, and Chowiet. In contrast, Hazy\nrecords an increase in pups population. Forrester Complex shows an\nincrease in pup counts since 1980, however, a 2002 record of 0 pups is\nconfusing. More analysis is required to explain this sudden drop in\npopulation.\nCitation\nFritz, Lowell; Sweeney, Kathryn; Lynn, Morgan; Gelatt, Thomas;\nGilpatrick, James; Towell, Rodney (2015). Counts of Alaska Steller sea\nlion pups conducted on rookeries in Alaska from 1961-06-22 to 2015-07-18\n(NCEI Accession 0128189). NOAA National Centers for Environmental\nInformation. Dataset. https://doi.org/10.7289/v5862ddr.\n\n\n\n",
    "preview": "posts/2022-02-07-trends-in-steller-sea-lion-pup-populations-for-five-alaskan-rookeries/trends-in-steller-sea-lion-pup-populations-for-five-alaskan-rookeries_files/figure-html5/unnamed-chunk-4-1.png",
    "last_modified": "2024-07-31T12:34:02-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-12-18-comparison-of-total-length-for-female-lizards-of-species-cnte-and-cnun/",
    "title": "Comparison of Total Length for Female Lizards of Species CNTE and CNUN",
    "description": "In this analysis, I compared the total length of female lizards from two species: CNTE (Cnemidophorus tessalatus, the Colorado Checkered lizard) and CNUN (Cnemidophorus uniparens, the Desert Grassland lizard). Using data collected from the Jornada Basin LTER between 1989 and 2006, I employed a two-sample t-test to assess the significance of the difference in total length between the two species, and quantified the effect size using Cohen’s d. The analysis revealed that CNTE females are significantly longer on average than CNUN females, with a large effect size.",
    "author": [
      {
        "name": "Mariano Viz",
        "url": {}
      }
    ],
    "date": "2021-12-18",
    "categories": [],
    "contents": "\nIntroduction\nThis report provides a comparison of the total length for female\nlizards of the species CNTE (Cnemidophorus tessalatus, the Colorado\nCheckered lizard) and CNUN (Cnemidophorus uniparens, the Desert\nGrassland lizard). Data was colected at Jornada Basin Long Term\nEcological Research (LTER) from 1989 to 2006 using pitfall traps that\nwere checked once a week at the minimum (Lightfoot, 2017). Following\nexploratory data visualization, total length of female lizards from the\nspecies CNTE and CNUN were compared by a two-sample t-tests\n(significance level (\\(\\alpha\\)) of\n0.05) and differences were described by Cohen’s d effect size.\nAll analyses are in R version 4.0.2 using RStudio version 1.3.1056.\n\n\n\n\n\n\nFigure 1. Total lengths (mm) of female lizards of\nthe species CNTE (Cnemidophorus tessalatus, the Colorado Checkered\nlizard) and CNUN (Cnemidophorus uniparens, the Desert Grassland lizard).\nOrange (CNTE, Cnemidophorus tessalatus) and teal (CNUN, Cnemidophorus\nuniparens) points indicate individual observations for total length\n(millimeters) of female lizards. Box endpoints indicate the\n25th and 75th percentile values. The black line\nand black point within the box indicate the total length median and mean\nvalue respectively. Data: Lightfoot (2017).\nTable 2. Descriptive statistics (mean, standard\ndeviation, and sample size) for total length (mm) of female lizards from\nthe species CNTE (Cnemidophorus tessalatus) and CNUN (Cnemidophorus\nuniparens). Data: Lightfoot (2017).\n\n\nSpecies\n\n\nMean total lenght (mm)\n\n\nStandard deviation (mm)\n\n\nSample Size\n\n\nCNTE\n\n\n244.9\n\n\n47.3\n\n\n28\n\n\nCNUN\n\n\n147.6\n\n\n34.6\n\n\n40\n\n\nDistributions of total length (plots not included) for female lizards\nof the species CNTE (Cnemidophorus tessalatus) and CNUN (Cnemidophorus\nuniparens) were relatively normal and symmetric (bell-shaped histogram\nand quantile-quantile plot with an almost linear relationship).\n\n\n\nOn average, the total length of CNTE (Cnemidophorus tessalatus)\nfemales is greater than that of CNUN (Cnemidophorus uniparens) females\n(244.89 \\(\\pm\\) 47.32 and 147.6 \\(\\pm\\) 34.55 mm, respectively; mean \\(\\pm\\) 1 standard deviation). The absolute\ndifference in means is 97.29 mm (a 49.58% difference). The effect size\nis large (Cohen’s d = 2.42) and the difference in means is\nsignificant (Welch two-sample t-test: t(46.43) = 9.28, p =\n3.75e-12).\nSummary\nExploratory data analysis reveals that, on average, the total length\nof female lizards of CNTE (Cnemidophorus tessalatus) is greater than\nthat of CNUN (Cnemidophorus uniparens). This difference in total length\nis significant, and the effect size is large.\nCitations\nLightfoot, D. 2017. Lizard pitfall trap data (LTER-II, LTER-III) ver\n36. Environmental Data Initiative. https://doi.org/10.6073/pasta/ff37b4cace16a9943575f3fd7067064e\n\n\n\n",
    "preview": "posts/2021-12-18-comparison-of-total-length-for-female-lizards-of-species-cnte-and-cnun/comparison-of-total-length-for-female-lizards-of-species-cnte-and-cnun_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2024-07-31T12:27:31-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-12-14-association-between-respondents-political-affiliation-and-environmentalist-self-identification/",
    "title": "Association Between Respondents’ Political Affiliation and Environmentalist Self-identification",
    "description": "In this analysis, I explored the association between respondents' political affiliation (Conservative or Liberal) and their self-identification as environmentalists using a chi-squared test. The analysis, based on survey data from 1,331 U.S. respondents collected in August 2017, aimed to determine whether there is a significant relationship between political affiliation and environmentalist self-identification. The chi-squared test revealed a significant association, indicating that these two variables are not independent.",
    "author": [
      {
        "name": "Mariano Viz",
        "url": {}
      }
    ],
    "date": "2021-12-14",
    "categories": [],
    "contents": "\nIntroduction\nThis report provides an exploratory analysis of the association\nbetween respondents’ political affiliation (Conservative or Liberal) and\nenvironmentalist self-identification (perception of respondents\nregarding whether they consider themselves environmentalists). Data was\ncollected in August 2017 from an online panel of 1,331 anonymous,\nnationwide U.S respondents (Andrews Forest LTER Site and C. Batavia.\n2019). The association between respondents’ political affiliation and\nenvironmentalist self-identification was explored by a chi-squared test\n(significance level (\\(\\alpha\\)) of\n0.05). All analyses are in R version 4.0.2 using RStudio version\n1.3.1056.\n\n\n\n\n\n\nTable 1. Counts and proportions of Conservative or\nLiberal survey respondents who responded “Yes”, “No” and “Unsure” to the\nstatement “I consider myself an environmentalist.” Data: Andrews Forest\nLTER Site and C. Batavia (2019).\n\n\n\n\nYes\n\n\nNo\n\n\nUnsure\n\n\nConservative\n\n\n34% (213)\n\n\n50% (318)\n\n\n16% (102)\n\n\nLiberal\n\n\n54% (281)\n\n\n24% (128)\n\n\n22% (114)\n\n\n\n\n\nThere is a significant association between respondents’ political\naffiliation (Conservative or Liberal) and environmentalist\nself-identification (perception of respondents regarding whether they\nconsider themselves environmentalists). In other words, political\naffiliation and environmentalist self-identification are non-independent\n(\\(\\chi\\)2(2) = 81.24,\np <2e-16).\nSummary\nSurvey data exploration reveals that there is a significant\nassociation (i.e. non-independence) between respondents’ political\naffiliation and environmentalist self-identification.\nCitations\nAndrews Forest LTER Site and C. Batavia. 2019. Influences on\ncharitable giving for conservation: Online survey data of 1,331\nrespondents across the US, August 2017 ver 3. Environmental Data\nInitiative. https://doi.org/10.6073/pasta/926e6270e324a1322a900da14d38b96c\n\n\n\n",
    "preview": {},
    "last_modified": "2024-07-31T12:19:29-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-11-16-exploratory-analysis-of-juvenile-snowshoe-hares-in-bonanza-creek-experimental-forest/",
    "title": "Exploratory Analysis of Juvenile Snowshoe Hares in Bonanza Creek Experimental Forest",
    "description": "In this analysis, I explored the data from a capture-recapture study of juvenile snowshoe hares (Lepus americanus) conducted in the Bonanza Creek Experimental Forest between 1999 and 2012. The study aimed to investigate trends in hare population over time, compare the weights of male and female juveniles using two-sample t-tests and Cohen’s d for effect size, and examine the relationship between their weight and hind foot length through simple linear regression analysis.",
    "author": [
      {
        "name": "Mariano Viz",
        "url": {}
      }
    ],
    "date": "2021-11-16",
    "categories": [],
    "contents": "\n1. Introduction\nThis report provides an exploratory analysis of juvenile snowshoe\nhare (Lepus americanus) surveyed in a capture-recapture study conducted\nin the Bonanza Creek Experimental Forest from 1999 to 2012 (Kielland et\nal. 2017). Specifically, this report presents: an exploration of the\ntotal number of juvenile snowshoe hares sampled by year in the Bonanza\nCreek Experimental Forest (1999-2012); a comparison of weights for\njuvenile male and female snowshoe hares; finally, an analysis of the\nrelationship between juvenile weight and hind foot length.\n2. Data and analyses\nSnowshoe hare data was collected and made available by Dr. Knut\nKielland and colleges at the Bonanza Creek Long Term Ecological Research\nStation in Alaska. The data contains 3197 observations from\ncapture-recapture studies of snowshoe hares, conducted from 1999 to\n2012. Following exploratory data visualization, juvenile male and female\nsnowshoe hares weights were compared by a two-sample t-tests\n(significance level (\\(\\alpha\\)) of\n0.05) and differences between groups were described by Cohen’s\nd effect size. Finally, the relationship between juvenile\nsnowshoe hare weight and hind foot length was explored by simple linear\nregression. All analyses are in R version 4.0.2 using RStudio version\n1.3.1056.\n3. Exploratory findings\nA. Annual juvenile\nsnowshoe hare trap counts\n\n\n\nFigure 1. Total number of juvenile snowshoe hare\n(observed via trap capture) by year.\nTable 1. Descriptive statistics (mean, median, minimum\nand maximum counts) for annual counts of juvenile snowshoe hare\ntrappings. Data: Kielland et al. (2017).\n\n\nAnnual Mean\n\n\nAnnual Median\n\n\nMaximum Count\n\n\nMinimum Count\n\n\n31.5\n\n\n18.5\n\n\n126\n\n\n2\n\n\n\n\n\nJuvenile snowshoe hare (observed via trap capture) were counted by\nyear. The minimum and maximum counts of juvenile hare trappings were 2\nand 126 respectively. The mean annual number of juvenile hares trapped\nwas 31.5 with a median annual number of 18.5 (Table 1, Figure 1). There\nis an overall decline in the annual counts of juvenile snowshoe hare for\nthe period 1999-2012. However, the number of days and traps in the study\nwere not standardized for each year, limiting the utility of this\nmethodology for accurately estimating the juvenile hare population.\nB.\nJuvenile snowshoe hare weights comparison by sex and site\n\n\n\nFigure 2. Weight (g) for juvenile snowshoe hare by\nsex and site (Bonanza Black Spruce, Bonanza Mature, and Bonanza\nRiparian). Gold (female), teal (male) and coral (NA) points indicate\nindividual observations for weight (grams) of juvenile snowshoe hare.\nBox endpoints indicate the 25th and 75th\npercentile values. The black line and black point within the box\nindicate the weights median and mean value respectively. Data: Kielland\net al. (2017).\nC. Juvenile\nhare mean weights comparison by sex\nDistributions of weights (plots not included) for juvenile male and\nfemale snowshoe hares were relatively normal and symmetric (bell-shaped\nhistogram and quantile-quantile plot with an almost linear\nrelationship).\nTable 2. Descriptive statistics (mean, standard\ndeviation, and sample size) for weights (g) of juvenile snowshoe hare\ntrappings by sex. Data: Kielland et al. (2017).\n\n\nSex\n\n\nMean Weight (g)\n\n\nStandard deviation (g)\n\n\nSample Size\n\n\nf\n\n\n855.4\n\n\n292.3\n\n\n197\n\n\nm\n\n\n945.9\n\n\n333.2\n\n\n163\n\n\n\n\n\nOn average, juvenile snowshoe hare males weight slightly more than\nfemale juvenile snowshoe hares (945.86 \\(\\pm\\) 333.22 and 855.39 \\(\\pm\\) 292.25 g, respectively; mean \\(\\pm\\) 1 standard deviation). The absolute\ndifference in means is 90.47 g (a 10.05% difference). The effect size is\nsmall (Cohen’s d = 0.29) and the difference in means is\nsignificant (Welch two-sample t-test: t(325.02) = 2.71, p <\n0.001).\nD.\nRelationship between juvenile snowshoe hare weight & hind foot\nlength\nThe relationship between hind foot length (mm) and weight (g) was\nexplored for juvenile snowshoe hares by simple lineal regression.\nAdditional variables as sex or sites were not included in the\nanalysis.\n\n\n\nFigure 3. Relationship between hind foot length (mm)\nand weight (g) for juvenile snowshoe hares. Points indicate individual\njuvenile snowshoe hare measurements. Linear model summary: \\(\\beta\\)1 = 9.52 g\nmm-1, p < 0.001, R2 = 0.3, Pearson’s r\n= 0.55). An equation of this linear model is also displayed in the plot\npanel. Data: Kielland et al. (2017).\nThe relationship between hind foot length (mm) and weight (g) for\njuvenile snowshoe hares appears relatively linear (Figure 3). Simple\nlinear regression showed that hind foot length is not a strong predictor\nof juvenile snowshoe hares weight (p < 0.001, R2 = 0.3);\ni.e., only 29.88% of the variance in weight is predictable from the hind\nfoot length. The average slope is \\(\\beta\\) = 9.52 g mm-1; meaning\nthat, on average, we expect weight to increase by 9.52grams for each one\nmillimeter increase in hind foot length. Hind foot length and weight are\nmoderately, and significantly, positively correlated (Pearson’s\nr = 0.55, p < 0.001). Diagnostic plots (not included) reveal\nnormally distributed (with a slight skew to the right) residuals.The\nheteroscedasticity of residuals shown in these plots is a major concern.\nLinear regression assumes that all residuals are drawn from a population\nthat has a constant variance of the error (homoscedasticity);\nheteroscedasticity can decrease the predictive capacity of the linear\nmodel by underestimating or overestimating uncertainty.\nSummary\nJuvenile hares data exploration reveals the following findings:\nThere is a decrease in the observations of juvenile snowshoe\nhares (observed via trap capture) from 1999 to 2012. However, as the\nnumber of days and traps in each year of the study were not standardized\nit is difficult to accurately estimate the real variation in the\njuvenile hare population.\nJuvenile snowshoe hare males weight, on average, slightly more\nthan female juvenile snowshoe hares. The difference in means is\nsignificant but the effect size is small (Cohen’s d =\n0.29).\nThe linear regression exploration of the relationship between\nhind foot length and weight for juvenile snowshoe hares revealed that\nhind foot length is not a strong predictor of weight (p < 0.001,\nR2 = 0.3). At the same time, the observed heteroscedasticity\nof residuals weakens the predictive capacity of this model.\nCitations\nKielland, K., F.S. Chapin, R.W. Ruess, and Bonanza Creek LTER.\n2017.Snowshoe hare physical data in Bonanza Creek Experimental Forest:\n1999-Present ver 22. Environmental Data Initiative. https://doi.org/10.6073/pasta/03dce4856d79b91557d8e6ce2cbcdc14\n\n\n\n",
    "preview": "posts/2021-11-16-exploratory-analysis-of-juvenile-snowshoe-hares-in-bonanza-creek-experimental-forest/exploratory-analysis-of-juvenile-snowshoe-hares-in-bonanza-creek-experimental-forest_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2024-07-31T12:13:18-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2024-07-31-macronutrients-and-energy-content-in-beef-products-pork-products-and-poultry-products/",
    "title": "Macronutrients and Energy Content in Beef Products, Pork Products, and Poultry Products",
    "description": "In this analysis, I explored the relationship between protein, carbohydrate, fat, and energy content in three food groups (Beef Products, Pork Products, and Poultry Products) using Principal Components Analysis (PCA). PCA is a statistical technique used to reduce the dimensionality of multivariate data while retaining as much information as possible. This allows for easier visualization and identification of patterns, relationships, and outliers. The results were visualized using a biplot, where the first two principal components explained 80% of the variance in the data, revealing strong correlations between certain macronutrients and the distinct clustering of food groups.",
    "author": [
      {
        "name": "Mariano Viz",
        "url": {}
      }
    ],
    "date": "2021-11-16",
    "categories": [],
    "contents": "\nIntroduction\nIn this report, I explore the variables protein, carbohydrate, fat,\nand energy content in three different food groups (Beef Products, Pork\nProducts, and Poultry Products) by performing a Principal Components\nAnalysis (PCA) and reflecting this information on a biplot. PCA is an\nordination method used to visualize patterns in multivariate data that\nallows to reframe multivariate data in a simplified number of dimensions\nwhile retaining as much information as possible. This way, PCA enables\nus to easily explore the relationship between the variables and identify\nmultivariate patterns and outliers. Data for this report was taken from\nthe USDA National Nutrient Database (https://fdc.nal.usda.gov/).\n\n\n\n\n\n\nFigure 1. Biplot of the PCA ordination performed for\nthe variables protein, carbohydrate, fat, and energy content in three\ndifferent food groups. Orange dots represent observations for Beef\nProducts, blue squares for Pork Products, and green triangles for\nPoultry Products. Their position reflects the score of each observation\nbased on the principal components (PC1 and PC2). Distance between\nobservations approximate the Euclidean distance and allow assessing\nsimilarity in multivariate space and identifying multivariate groups and\noutliers. Arrows show the loading of variables for each principal\ncomponent (PC1 and PC2). Their length indicates variance in the\nprincipal component direction (PC1 horizontal component and PC2 vertical\ncomponent); the angle between them shows the variables correlation. Data\nUSDA (2019).\nSummary\nDisplayed PCA biplot describes 80% of variance in the analyzed data\n(PC1 55% and PC2 25%). The arrows convey information about the examined\nvariables. The small angle separating the variables fat and energy\nreveals a strong positive correlation between them. In turn, these\nvariables are negatively correlated with protein and not highly\ncorrelated with carbohydrates (almost right angle). At the same time,\nthe distribution of observation in the biplot enables recognizing\nmultivariate groups and outliers. Here we can observe a big cluster of\nmultivariate similar observations in the center of the biplot and some\noutlier observations extending vertically (poultry products) and\nhorizontally (mainly beef and pork products).\nCitation:\nU.S. Department of Agriculture, Agricultural Research Service.\nFoodData Central, 2019. https://fdc.nal.usda.gov/\n\n\n\n",
    "preview": "posts/2024-07-31-macronutrients-and-energy-content-in-beef-products-pork-products-and-poultry-products/macronutrients-and-energy-content-in-beef-products-pork-products-and-poultry-products_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2024-07-31T12:50:25-03:00",
    "input_file": {}
  }
]
